# running in formal/src/
read -sv counter4bit.v
prep -top counter4bit
hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
