# running in apb_uart/src/
read -formal apb_uart.v
prep -top apb_uart

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
